sethconfig.org
#+TITLE: Seth Rothschild's Emacs Configuration 
#+OPTIONS: toc:2 h:4
<<babel-init>>

I use emacs as most of my operating system. As such, the
packages and code here has been built up around the way that
I work. That means that this is probably not a useful
configuration for you: if you're a new user this contains
code you don't need and if you're an experienced user you
have your own way of doing things.

This is my third version of my init file, but the first that
I'm using with =org-babel= and the first that I'm uploading
to Github. In my previous iteration I was using evil mode
extensively. To replace that, I'm experimenting with hydra
and key-chord as found here.

The overall structure is based on the excellent formatting
in [[http://sachachua.com/dotemacs][Sacha Chua's Emacs Configuration]]. It is called when emacs starts by the line
=(org-babel-load-file (expand-file-name "sethconfig.org" user-emacs-directory))=
in my init file. That command creates the =sethconfig.el= file.

* Configuration
This configuration is broken into two parts. The first
section is my current configuration which in the future will
be fairly stable. The second section should be functions and
packages that I'm not sure I want to incorporate into my
workflow. For one time testing of elisp I use the scratch
buffer.

** Starting up
The first order of business is modifying my load-path and
exec-path to include melpa and things I've installed through
homebrew. I hadn't considered modifying =custom-file=, but
I've really liked it since it keeps the clutter out of this
file.

#+BEGIN_SRC emacs-lisp :tangle yes
(require 'package)
(add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/"))
(package-initialize)             

(add-to-list 'exec-path "/usr/local/bin/")
(add-to-list 'exec-path "/usr/bin/")
(add-to-list 'load-path "/usr/share/emacs/24.3/lisp")

(setq custom-file "~/.emacs.d/custom-settings.el")
(load custom-file t)

(require 'use-package)
(server-start)

;; I use the server so that I can open applications with emacsclient without
;; running the entire init file again. In automator, I exported
;; for f in "$@"
;;  do
;;	/usr/local/bin/emacsclient -a "" -n "$f"
;;  done
;; as EmacsClient.app, and set that as the default application to open things
#+END_SRC

** Appearance 
Fill column is set small right now. If I end up liking margin changes
which are currently experimental, I might not need it quite
so small.

This section is mostly "common sense" changes for how I
expected emacs to act. I've turned off the bell, changed to
=y-or-n= and disabled automatic indenting. 
#+BEGIN_SRC emacs-lisp :tangle yes
(require 'recentf)
(which-key-mode)
(require 'dired-x)

(setq-default fill-column 60)

(setq column-number-mode t)
(electric-indent-mode 0)
(defalias 'yes-or-no-p 'y-or-n-p)
(setq ring-bell-function 'ignore)
(setq sentence-end-double-space nil)   

(setq read-buffer-completion-ignore-case t)
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq recentf-max-saved-items 150)
#+END_SRC
I use dired-x to clean up my =.tex= folders and make them a
little easier to read from emacs. The only thing I might
want to see again are files that begin with a dot, so I
might modify this later.  
#+BEGIN_SRC emacs-lisp :tangle yes
(setq default-directory "~/")
(setq dired-omit-files 
  (concat dired-omit-files
    "\\|^\\..+$\\|^.
    +?\\.aux$\\|^.
    +?\\.log$\\|^.
    +?sync\\|^.
    +?out\\|^.
    +?run.xml")
)
                         
(add-hook 'dired-mode-hook
  (lambda ()
    (dired-omit-mode 1)
))

(global-unset-key (kbd "M-o"))
(global-set-key (kbd "M-o") 'dired-omit-mode)

(global-unset-key (kbd "C-l"))
(global-set-key (kbd "C-l") 'dired-up-directory)

;; Found on http://jblevins.org/log/dired-open
(eval-after-load "dired"
  '(progn
     (define-key dired-mode-map (kbd "z")
       (lambda () (interactive)
         (let ((fn (dired-get-file-for-visit)))
           (start-process "default-app" nil "open" fn))))))
#+END_SRC
** Movement
*** Helm
These replace the ordinary emacs functions with their =helm=
counterparts. I completely bypassed these keybindings while
using evil mode and will do the same with =hydra= below.

Of the helm functions, =helm-show-kill-ring= and =helm-M-X=
might be the only keybindings I use. In the helm spirit of
seeing things =helm-swoop= is really nice. It's not quite a
natural part of my workflow yet. I would like to
1. Find a place where I would actually use helm-multi-swoop in a natural way
2. Find a way to more efficiently use edit mode.
   + Need better keybinds for edit mode
   + Need to automatically select the swooped text when entering edit mode 

#+BEGIN_SRC emacs-lisp :tangle yes
(require 'helm)
(require 'helm-config)
(helm-mode 1)

(setq helm-split-window-in-side-p       t 
  helm-move-to-line-cycle-in-source     t 
  helm-ff-search-library-in-sexp        t 
  helm-scroll-amount                    8 
  helm-ff-file-name-history-use-recentf t
)
(helm-autoresize-mode t)

(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) 
(define-key helm-map (kbd "C-z")  'helm-select-action) 

(global-set-key (kbd "C-x b") 'helm-mini)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-c h") 'helm-command-prefix)

(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "M-y") 'helm-show-kill-ring)

(use-package helm-swoop
  :bind
  ("C-s" . helm-swoop)
)
(setq helm-swoop-pre-input-function (lambda () ""))
#+END_SRC
*** Hydra
This is moving in the right direction though it is far from
settled. Structurally, I like the way it is set up. The main
idea is that I have three distinct movement types in emacs:
+ Movement commands inside of a window 
+ Movement commands between windows
+ Functions where I need easy access 

I think it's worth noting that the keybinding overlap is
actually crucial for moving fluidly in emacs. That
*necessitates* the use of a conditional hydra. If I
start in an =.org= file and move to a =.tex= file, my keybindings
should be different.

     
#+BEGIN_SRC emacs-lisp :tangle yes
(defun select-current-line ()
  "Select the current line"
  (interactive)
  (end-of-line)
  (set-mark (line-beginning-position))
)



(defhydra nomodifier-movement (
    :hint nil
    :pre (set-cursor-color "#990000")
    :post (progn (set-cursor-color "#000000")
                 (evil-mode 0))
  )
  "Movement Hydra"
  ("a" beginning-of-line)
  ("A" backward-sentence)
  ("b" backward-char)
  ("B" backward-word)
  ("d" evil-delete)
  ("e" end-of-line)
  ("E" forward-sentence)
  ("f" evil-find-char)
  ("F" evil-find-char-backward)
  ("j" evil-forward-paragraph)
  ("k" evil-backward-paragraph)
  ("m" evil-jump-item)
  ("n" next-line)
  ("N" (next-line 5))
  ("p" previous-line)
  ("P" (previous-line 5))
  ("r" evil-replace)
  ("s" evil-search-forward)
  ("u" undo-tree-undo)
  ("U" undo-tree-redo)
  ("v" set-mark-command)
  ("V" select-current-line)
  ("x" delete-char)
  ("X" delete-backward-char)
  ("y" yank) 
  
  ("il" (progn (newline)
    (insert-string "<s")
    (org-try-structure-completion)
    (insert-string "emacs-lisp :tangle yes")
    (next-line)
  ))
  ("ip" (progn (newline)
    (insert-string "<s")
    (org-try-structure-completion)
    (insert-string "python :results output :session *Python* :tangle yes")
    (next-line)
  ))

  ("t" org-todo)
  ("." org-time-stamp)
  ("<left>" org-metaleft)
  ("<right>" org-metaright)
  ("<up>" org-metaup)
  ("<down>" org-metadown)
  
  ("o" window-movement/body "Window movement" :exit t)
  ("SPC" spacehydra-movement/body "Spacehydra" :exit t)
  ("q" nil "Quit" :exit t)
)

(defhydra window-movement (
    :hint nil
    :columns 6
    :pre
    (set-cursor-color "#009900")
    :post
    (set-cursor-color "#000000")
  )
  "Window Movement"
  ("<left>" windmove-left "Window left")
  ("<right>" windmove-right "Window right")
  ("<down>" windmove-down "Window down")
  ("<up>" windmove-up "Window up")
  ("b" helm-mini "Buffer")
  ("B" (progn (other-window 1) (helm-mini)) "Buffer other")
  ("d" delete-window "Delete")
  ("D" delete-other-windows "Delete other")
  ("f" find-file)
  ("F" find-file-other-window)
  ("h" split-window-below)
  ("k" kill-buffer "Kill buffer")
  ("o" other-window)
  ("v" split-window-right)

  ("SPC" spacehydra-movement/body "Spacehydra" :exit t)
  ("n" nomodifier-movement/body :exit t)
  ("p" nomodifier-movement/body :exit t)
  ("q" nil "Quit" :exit t)
)


(defhydra spacehydra-movement (
    :hint nil
    :columns 6
    :exit t 
    :pre
    (set-cursor-color "#000099")
    :post
    (set-cursor-color "#000000")
  )
  "Space-Hydra"
  ("a" org-agenda "Agenda")
  ("b" helm-mini)
  ("c" org-capture "Capture")
  ("d" dired) 
  ("fa" helm-ag "Find with ag")
  ("fr" helm-ag-project-root "Find from root")
  ("ff" helm-find-file "Find file")
  ("hf" describe-function)
  ("hi" info)
  ("hk" describe-key)
  ("hm" describe-mode)
  ("hv" describe-variable)
  ("ls" org-store-link "Store link")
  ("li" org-insert-link "Insert link")
  ("s" save-buffer "Save")
  ("t" (find-file (TODO-file-today)) "Today's todo")
  ("m" magit-status "Magit status")
  ("x" helm-M-x)

  ("n" nomodifier-movement/body :exit t)
  ("p" nomodifier-movement/body :exit t)
  ("o" window-movement/body "Window movement" :exit t)

  ("q" nil "Quit" :exit t)
)

(key-chord-mode 1)
(key-chord-define-global "np" 'nomodifier-movement/body)

(global-unset-key (kbd "C-x o")) 
(global-set-key (kbd "C-x o") 'window-movement/body)

(global-set-key (kbd "<escape>") 'spacehydra-movement/body)
#+END_SRC


** Packages
