sethconfig.org
*** AucTeX 
This section needs serious cleaning. Much of it is OS
specific and I'm not sure what half of it does or why it's
here in the first place. Seems like a good project for a
weekend.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
  (setq reftex-plug-into-AUCTeX t)
  (setq TeX-PDF-mode t)
  (add-hook 'LaTeX-mode-hook 'auto-fill-mode)
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (add-hook 'LaTeX-mode-hook
    (lambda () (local-set-key (kbd "<M-S-mouse-1>") #'TeX-view))
  )
  (add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
  
  (getenv "PATH")
  (setenv "PATH" (concat "/usr/texbin" ":"
      (getenv "PATH")
    )
  )
  (getenv "PATH")
  
  (setenv "PATH" (concat "/usr/local/bin" ":"
      (getenv "PATH")
    )
  )
  (setenv "PATH" (concat "/usr/bin" ":"
      (getenv "PATH")
    )
  )
  
  (setq TeX-source-correlate-method 'synctex)
  (setq TeX-view-program-selection '((output-pdf "PDF Viewer")))

  (setq TeX-view-program-list '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b %n %o %b")))
  (add-hook 'LaTeX-mode-hook 
    (lambda()
      (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t" TeX-run-TeX nil t))
      (setq TeX-save-query nil)
      (setq TeX-show-compilation nil)
    )
  )

  (add-hook 'LaTeX-mode-hook #'outline-minor-mode)
#+END_SRC
*** GAP
GAP and Pari are here for the same reason, would it be
reasonable for them to be in the same subsection? I should
include links to both projects.
#+BEGIN_SRC emacs-lisp :tangle yes
  (autoload 'gap-mode "gap-mode" "Gap editing mode" t)
  (setq auto-mode-alist (append (list '("\\.g$" . gap-mode)
    '("\\.gap$" . gap-mode))
    auto-mode-alist))
  (autoload 'gap "gap-process" "Run GAP in emacs buffer" t)
  (setq gap-executable "/Users/seth/Downloads/gap4r8/bin/gap-default64.sh")
  (setq gap-start-options '("-n" "-f" "-b" "-m" "2g"))
#+END_SRC
*** GP/Pari
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'load-path "/usr/local/bin/pari")
  (autoload 'gp-mode "pari" nil t)
  (autoload 'gp-script-mode "pari" nil t)
  (autoload 'gp "pari" nil t)
  (autoload 'gpman "pari" nil t)
  (setq auto-mode-alist (cons '("\\.gp$" . gp-script-mode)
    auto-mode-alist))
#+END_SRC

*** Elpy
#+BEGIN_SRC emacs-lisp :tangle yes
(elpy-enable)
(require 'py-autopep8)
(add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)
(setq python-shell-completion-native-enable nil)
(setenv "WORKON_HOME" "~/../")
(pyvenv-mode 1)
(pyvenv-activate "homeenv")
(elpy-use-ipython "ipython")

(defun my-python-noindent-docstring (&optional _previous)
  (if (eq (car (python-indent-context)) :inside-docstring)
      'noindent))

(advice-add 'python-indent-line :before-until #'my-python-noindent-docstring)

#+END_SRC

*** Jabber 
#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'jabber)
  (setq 
    jabber-roster-line-format " %c %-25n %u %-8s"
    jabber-chat-buffer-show-avatar nil
    jabber-history-enabled t
    jabber-use-global-history t
    jabber-backlog-number 40
    jabber-backlog-days 30
  )
#+END_SRC
*** Magit
#+BEGIN_SRC emacs-lisp :tangle yes
(setq magit-repository-directories '("~/Desktop/Repositories"))
#+END_SRC
*** Multiple Cursors 
This is in sore need of a hydra. I wonder if it works with =artist-mode=?
#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
#+END_SRC
*** Twitter
#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'twittering-mode)
  (defun twitter-open-link ()
    (twittering-goto-next-thing t)
    (twittering-enter)
  )
  (if twittering-mode-map
    (let ((km twittering-mode-map))
      (define-key km (kbd "n") 'twittering-goto-next-status)
      (define-key km (kbd "p") 'twittering-goto-previous-status)
      (define-key km (kbd "N") 'twittering-goto-next-status-of-user)
      (define-key km (kbd "P") 'twittering-goto-previous-status-of-user)
      (define-key km (kbd "o") 'twitter-open-link)
      nil
    )
  )
#+END_SRC
** Lisp
From [[wikemacs.org/wiki/Emacs_Lisp_Cookbook]]:
#+BEGIN_SRC emacs-lisp :tangle yes
(defun file-string (file)
    "Read the contents of a file and return as a string."
    (with-current-buffer (find-file-noselect file)
      (buffer-string)))
#+END_SRC
Make a box around a title:
#+BEGIN_SRC emacs-lisp :tangle yes
(defun boxify ()
  (interactive)
  (beginning-of-line)
  (newline)
  (previous-line)
  (insert "+------------------------------")
  (next-line)
  (beginning-of-line)
  (insert "|  ")
  (end-of-line)
  (insert "  |")
  (newline)
  (insert "+------------------------------")
  (previous-line 1)
  (previous-line 1)  
  (backward-char)
  (kill-line)
  (insert "+")
  (next-line 2)
  (backward-char)
  (kill-line)
  (insert "+")
)
#+END_SRC
Kill the mu4e update process when it gets stuck. This hasn't
been a problem since the offlineimap update but there's
still an error thrown. A problem for another day.
#+BEGIN_SRC emacs-lisp :tangle yes
(defun mu4e-kill-update-process ()
  (interactive)
  (kill-process " *mu4e-update*")
)
#+END_SRC
** Mu4e
My configuration for mu4e is extensive and ugly. It used to
be in its own file. One of the big reasons I moved to org is
so that I could conveniently move this into the same file.
Much like my [[AucTeX]] configuration, I don't really know why
some of this is in here or what it does. 
#+BEGIN_SRC emacs-lisp :tangle yes
(cond 
  (
    (eq system-type 'windows-nt)
    (setq elpy-rpc-python-command "C:\\python27\\python")   
    (setq python-shell-interpreter "C:\\python27\\python")
  )
  (
    (eq system-type 'darwin)
    (load-file "~/.emacs.d/personal.el")

    (setq mu4e-maildir "~/Maildir")
    
    (setq mu4e-drafts-folder "/Gmail/[Gmail].Drafts")
    (setq mu4e-sent-folder   "/Gmail/[Gmail].Sent Mail")
    (setq mu4e-trash-folder  "/Gmail/[Gmail].Trash")
    
    (setq mu4e-sent-messages-behavior 'sent)
    
    (setq mu4e-maildir-shortcuts
      '(("/Gmail/INBOX"     . ?i)
        ("/Outlook/INBOX"   . ?e)
      )
    )
    
    (setq mu4e-get-mail-command "mbsync gmail")
    (setq mu4e-update-interval 180)
    (setq mu4e-split-view 'horizontal)
    (setq mu4e-headers-visible-lines 14)
    
    (setq mu4e-headers-fields
      '((:human-date    .  12)
        (:flags         .   6)
        (:from          .  22)
        (:to            .  22)
        (:subject       .  nil)
      )
    )

    
    (setq message-signature nil)
    (setq message-signature-file "~/.emacs.d/.signature")
    (setq mu4e-compose-signature-auto-include nil)
    (setq mu4e-compose-signature (file-string "~/.emacs.d/.signature"))
    (setq mu4e-compose-dont-reply-to-self t)
    
    (setq starttls-gnutls-program "/usr/local/bin/gnutls-cli")
    
    (require 'smtpmail)
    
    (setq message-kill-buffer-on-exit t)
    

  (add-hook 'mu4e-compose-mode-hook 'flyspell-mode)
  
  (require 'gnus-dired)

  (defun gnus-dired-mail-buffers ()
    "Return a list of active message buffers."
    (let (buffers)
      (save-current-buffer
        (dolist (buffer (buffer-list t))
          (set-buffer buffer)
  	  (when (and (derived-mode-p 'message-mode)
  	      (null message-sent-message-via)
            )
            (push (buffer-name buffer) buffers)
          )
        )
      )
      (nreverse buffers)
    )
  )
  
  (setq gnus-dired-mail-mode 'mu4e-user-agent)
  (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)
  
  (require 'org-mu4e)
  
  (add-to-list 'mu4e-view-actions
    '("ViewInBrowser" . mu4e-action-view-in-browser) t)
  (add-to-list 'helm-find-files-actions
    '("Attach files for mu4e" .
      helm-mu4e-attach
    ) t
  )
  
  (defun helm-mu4e-attach (_file)
    (gnus-dired-attach (helm-marked-candidates))
  )
  (require 'helm-mu)
  (setq mu4e-hide-index-messages 1)
  
  (mu4e-alert-set-default-style 'notifier)
  (setq alert-notifier-command "/usr/local/bin/terminal-notifier")
  (add-hook 'after-init-hook #'mu4e-alert-enable-notifications)
  (add-hook 'after-init-hook #'mu4e-alert-enable-mode-line-display)
  
  
  (require 'mu4e-contrib) 
  (setq mu4e-html2text-command 'mu4e-shr2text) 
  )

)
#+END_SRC
