sethconfig.org
** Org
This is not yet up to speed with my previous configuration.
Much of how I interact with =org= is handled by the
conditional hydra above.
#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-capture-templates '(
    ("t" "TODO capture"
         entry (file (TODO-file-today))
         "* TODO %?")
    ("l" "TODO capture with link"
         entry (file (TODO-file-today))
         "* TODO %?\n  From: %a")
))

(setq org-return-follows-link t)
(setq org-cycle-emulate-tab nil)
(setq org-directory "~/.emacs.d/org-files")
(setq org-agenda-files (file-expand-wildcards "~/.emacs.d/org-files/*.org"))

(setq org-todo-keywords
  '((sequence "TODO" "|" "DONE" "WAIT")))
(setq org-todo-keyword-faces
  '(("TODO" . org-warning) ("WAIT" . "blue")))
#+END_SRC
I find that I like making throwaway todo lists when I have a
lot of things that need doing. I've tried an overarching org
setup in the past but it seems to not stick. Instead of
trying that again, I'm going to try to enhance the habits I
tend towards naturally. The first two functions are slightly
modified from
[[http://www.howardism.org/Technical/Emacs/journaling-org.html]]
#+BEGIN_SRC emacs-lisp :tangle yes
(defun get-TODO-file-today ()
  "Return filename for today's journal entry."
  (let ((daily-name (format-time-string "%Y-%m-%d")))
    (expand-file-name (concat "~/.emacs.d/org-files/" daily-name ".org"))))

(defun TODO-file-today ()
  "Create and load a journal file based on today's date."
  (if (equal (file-exists-p (get-TODO-file-today)) t)
    (get-TODO-file-today)
    (progn
      (find-file (get-TODO-file-today))
      (insert-string (concat "#+TITLE: TODO List for " (format-time-string "%A, %B %d")))
      (newline)
      (insert-string "#+DATE: ")
      (calendar)
      (find-file (get-TODO-file-today))
      (org-date-from-calendar)
      (save-buffer t)
      (setq org-agenda-files (file-expand-wildcards "~/.emacs.d/org-files/*.org"))
      (get-TODO-file-today)
      (delete-other-windows)
    )  
  )
)

(setq org-src-fontify-natively t)
#+END_SRC

* Elisp for testing
I haven't yet decided if I'll use these, so I'll keep them
here until I either find a home for them or delete them.
** Undo-tree
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package undo-tree
  :diminish undo-tree-mode
  :config
  (progn
    (global-undo-tree-mode)
    (setq undo-tree-visualizer-timestamps t)
    (setq undo-tree-visualizer-diff t)))
#+END_SRC

** Reading
From [[http:ergoemacs.com/emacs/emacs_make_modern.html]]

This has the potential to be really nice, but I need to
figure out how I want to configure =visual-line-mode= first.
#+BEGIN_SRC emacs-lisp :tangle yes
(defun xah-toggle-margin-right ()
  "Toggle the right margin between `fill-column' or window width.
This command is convenient when reading novel, documentation."
  (interactive)
  (if (eq (cdr (window-margins)) nil)
      (set-window-margins nil 0 (- (window-body-width) fill-column))
    (set-window-margins nil 0 0) ) )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes


#+END_SRC
